/*
 Navicat Premium Data Transfer

 Source Server         : lcoa
 Source Server Type    : MySQL
 Source Server Version : 80013 (8.0.13)
 Source Host           : localhost:3306
 Source Schema         : jgj-project

 Target Server Type    : MySQL
 Target Server Version : 80013 (8.0.13)
 File Encoding         : 65001

 Date: 27/01/2026 14:37:57
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for project_tasks
-- ----------------------------
DROP TABLE IF EXISTS `project_tasks`;
CREATE TABLE `project_tasks`  (
  `task_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '任务ID',
  `project_id` int(11) NOT NULL,
  `project_serial_number` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '项目编号',
  `project_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '项目名称',
  `project_manager` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '项目经理',
  `task_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '任务名称',
  `wbs_code` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT 'WBS编码',
  `planned_start_date` date NULL DEFAULT NULL COMMENT '计划开始日期',
  `planned_end_date` date NULL DEFAULT NULL COMMENT '计划结束日期',
  `actual_start_date` date NULL DEFAULT NULL COMMENT '实际开始日期',
  `actual_end_date` date NULL DEFAULT NULL COMMENT '实际结束日期',
  `progress` decimal(5, 2) NULL DEFAULT NULL COMMENT '进度',
  `task_owner` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '任务负责人',
  `task_status` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '任务状态',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`task_id`) USING BTREE,
  INDEX `idx_project_serial`(`project_serial_number` ASC) USING BTREE,
  CONSTRAINT `project_tasks_ibfk_1` FOREIGN KEY (`project_serial_number`) REFERENCES `projects` (`project_serial_number`) ON DELETE CASCADE ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 541 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '项目任务表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of project_tasks
-- ----------------------------
INSERT INTO `project_tasks` VALUES (271, 1, NULL, '1', '阳绪文', '0100项目策划阶段', '1', '2026-01-04', '2026-01-04', '2026-01-04', '2026-01-04', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (272, 1, NULL, '1', '阳绪文', '     项目需求分析', '1.1', '2026-01-04', '2026-01-04', '2026-01-04', '2026-01-04', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (273, 1, NULL, '1', '阳绪文', '     召开项目启动会', '1.2', '2026-01-04', '2026-01-04', '2026-01-04', '2026-01-04', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (274, 1, NULL, '1', '阳绪文', '     组建项目团队', '1.3', '2026-01-04', '2026-01-04', '2026-01-04', '2026-01-04', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (275, 1, NULL, '1', '阳绪文', '     项目计划制定', '1.4', '2026-01-04', '2026-01-04', '2026-01-04', '2026-01-04', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (276, 1, NULL, '1', '阳绪文', '项目设计研发阶段', '2', '2026-01-04', '2026-01-07', '2026-01-04', '2026-01-07', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (277, 1, NULL, '1', '阳绪文', '     设计三维梳理及二维输出', '2.1', '2026-01-04', '2026-01-07', '2026-01-04', '2026-01-07', 100.00, '杨文博', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (278, 1, NULL, '1', '阳绪文', '样机试制阶段', '3', '2026-01-04', '2026-02-01', NULL, NULL, 22.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (279, 1, NULL, '1', '阳绪文', '     工艺BOM及流程下发', '3.1', '2026-01-08', '2026-01-09', '2026-01-08', '2026-01-09', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (280, 1, NULL, '1', '阳绪文', '     0项目订单下达', '3.2', '2026-01-10', '2026-01-10', '2026-01-10', '2026-01-10', 100.00, '向浩', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (281, 1, NULL, '1', '阳绪文', '      PFMEA分析', '3.3', '2026-01-10', '2026-01-15', '2026-01-10', '2026-01-15', 0.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (282, 1, NULL, '1', '阳绪文', '     工艺文件编制', '3.4', '2026-01-10', '2026-01-15', '2026-01-10', '2026-01-15', 0.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (283, 1, NULL, '1', '阳绪文', '     特殊工序识别确认', '3.5', '2026-01-10', '2026-01-15', '2026-01-10', '2026-01-15', 0.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (284, 1, NULL, '1', '阳绪文', '     工艺验证', '3.6', '2026-01-10', '2026-01-15', '2026-01-10', '2026-01-15', 0.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (285, 1, NULL, '1', '阳绪文', '     编制质量控制文件', '3.7', '2026-01-10', '2026-01-15', '2026-01-10', '2026-01-15', 0.00, '唐再章', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (286, 1, NULL, '1', '阳绪文', '     样机生产', '3.8', '2026-01-04', '2026-02-01', NULL, NULL, 36.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (287, 1, NULL, '1', '阳绪文', '          原材料采购', '3.8.1', '2026-01-04', '2026-01-09', '2026-01-04', '2026-01-04', 100.00, '刘年花', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (288, 1, NULL, '1', '阳绪文', '          配件采购（下料件、机加件）', '3.8.2', '2026-01-10', '2026-01-14', '2026-01-10', '2026-01-14', 100.00, '刘嘉', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (289, 1, NULL, '1', '阳绪文', '          配件焊前表处（下料件、方管）', '3.8.3', '2026-01-15', '2026-01-15', '2026-01-15', '2026-01-15', 0.00, '申外成', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (290, 1, NULL, '1', '阳绪文', '          片装组焊', '3.8.4', '2026-01-16', '2026-01-18', '2026-01-16', '2026-01-18', 0.00, '申外成', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (291, 1, NULL, '1', '阳绪文', '          柜体组焊', '3.8.5', '2026-01-19', '2026-01-22', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (292, 1, NULL, '1', '阳绪文', '          吊耳机加', '3.8.6', '2026-01-23', '2026-01-23', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (293, 1, NULL, '1', '阳绪文', '          内部焊接评审', '3.8.7', '2026-01-23', '2026-01-23', NULL, NULL, 0.00, '申外成,唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (294, 1, NULL, '1', '阳绪文', '          客户焊接评审', '3.8.8', '2026-01-24', '2026-01-24', NULL, NULL, 0.00, '王志强,申外成,唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (295, 1, NULL, '1', '阳绪文', '          喷砂及底漆工序', '3.8.9', '2026-01-25', '2026-01-26', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (296, 1, NULL, '1', '阳绪文', '          顶板铆接工序', '3.8.10', '2026-01-27', '2026-01-27', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (297, 1, NULL, '1', '阳绪文', '          油漆工序', '3.8.11', '2026-01-28', '2026-01-30', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (298, 1, NULL, '1', '阳绪文', '          组装工序', '3.8.12', '2026-01-31', '2026-01-31', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (299, 1, NULL, '1', '阳绪文', '          例行试验（流量、气密、称重）', '3.8.13', '2026-02-01', '2026-02-01', NULL, NULL, 0.00, '申外成,唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (300, 1, NULL, '1', '阳绪文', '评审', '4', '2026-02-01', '2026-02-02', NULL, NULL, 0.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (301, 1, NULL, '1', '阳绪文', '               内部评审', '4.1', '2026-02-01', '2026-02-01', NULL, NULL, 0.00, '唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (302, 1, NULL, '1', '阳绪文', '               客户评审', '4.2', '2026-02-02', '2026-02-02', NULL, NULL, 0.00, '唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (303, 1, NULL, '1', '阳绪文', '项目收尾', '5', '2026-02-03', '2026-02-10', NULL, NULL, 0.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (304, 1, NULL, '1', '阳绪文', '     发货', '5.1', '2026-02-03', '2026-02-03', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (305, 1, NULL, '1', '阳绪文', '     项目文件归档', '5.2', '2026-02-03', '2026-02-10', NULL, NULL, 0.00, '王志强', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (306, 2, NULL, '川藏制动柜项目计划', '阳绪文', '0100项目策划阶段', '1', '2025-12-26', '2025-12-28', '2025-12-26', '2025-12-27', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (307, 2, NULL, '川藏制动柜项目计划', '阳绪文', '     项目需求分析', '1.1', '2025-12-26', '2025-12-27', '2025-12-26', '2025-12-27', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (308, 2, NULL, '川藏制动柜项目计划', '阳绪文', '     召开项目启动会', '1.2', '2025-12-27', '2025-12-27', '2025-12-27', '2025-12-27', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (309, 2, NULL, '川藏制动柜项目计划', '阳绪文', '     组建项目团队', '1.3', '2025-12-27', '2025-12-27', '2025-12-27', '2025-12-27', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (310, 2, NULL, '川藏制动柜项目计划', '阳绪文', '     项目计划制定', '1.4', '2025-12-27', '2025-12-27', '2025-12-27', '2025-12-27', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (311, 2, NULL, '川藏制动柜项目计划', '阳绪文', '0300样机试制阶段', '2', '2025-12-28', '2026-01-15', '2025-12-28', NULL, 86.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (312, 2, NULL, '川藏制动柜项目计划', '阳绪文', '     030001工艺BOM及流程下发', '2.1', '2025-12-28', '2025-12-28', '2025-12-28', '2025-12-28', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (313, 2, NULL, '川藏制动柜项目计划', '阳绪文', '     030002项目订单下达', '2.2', '2025-12-28', '2025-12-28', '2025-12-28', '2025-12-28', 100.00, '黄万庆', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (314, 2, NULL, '川藏制动柜项目计划', '阳绪文', '     030003 PFMEA分析', '2.3', '2025-12-28', '2026-01-05', '2025-12-28', '2025-12-28', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (315, 2, NULL, '川藏制动柜项目计划', '阳绪文', '     030004工艺文件编制', '2.4', '2025-12-28', '2026-01-05', '2025-12-28', '2025-12-28', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (316, 2, NULL, '川藏制动柜项目计划', '阳绪文', '     030005特殊工序识别确认', '2.5', '2025-12-28', '2026-01-05', '2025-12-28', '2025-12-28', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (317, 2, NULL, '川藏制动柜项目计划', '阳绪文', '     030006工艺验证', '2.6', '2025-12-28', '2026-01-05', '2025-12-28', '2025-12-28', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (318, 2, NULL, '川藏制动柜项目计划', '阳绪文', '     030007编制质量控制文件', '2.7', '2025-12-28', '2026-01-05', '2025-12-28', '2025-12-28', 100.00, '唐再章', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (319, 2, NULL, '川藏制动柜项目计划', '阳绪文', '     030008样机生产', '2.8', '2025-12-28', '2026-01-15', '2025-12-28', NULL, 68.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (320, 2, NULL, '川藏制动柜项目计划', '阳绪文', '          030008-1原材料采购', '2.8.1', '2025-12-28', '2025-12-28', '2025-12-28', '2025-12-28', 100.00, '刘年花', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (321, 2, NULL, '川藏制动柜项目计划', '阳绪文', '          030008-2配件采购（下料件、机加件）', '2.8.2', '2025-12-28', '2026-01-14', '2025-12-28', '2026-01-03', 100.00, '刘嘉', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (322, 2, NULL, '川藏制动柜项目计划', '阳绪文', '          030008-3片装组焊', '2.8.3', '2026-01-05', '2026-01-06', '2026-01-04', '2026-01-06', 100.00, '刘嘉', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (323, 2, NULL, '川藏制动柜项目计划', '阳绪文', '          030008-4柜体组焊', '2.8.4', '2026-01-06', '2026-01-10', '2026-01-06', NULL, 0.00, '刘嘉', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (324, 2, NULL, '川藏制动柜项目计划', '阳绪文', '          030008-5内部焊接评审', '2.8.5', '2026-01-11', '2026-01-11', NULL, NULL, 0.00, '唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (325, 2, NULL, '川藏制动柜项目计划', '阳绪文', '          030008-6喷砂及底漆工序', '2.8.6', '2026-01-11', '2026-01-12', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (326, 2, NULL, '川藏制动柜项目计划', '阳绪文', '          030008-7油漆工序', '2.8.7', '2026-01-13', '2026-01-13', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (327, 2, NULL, '川藏制动柜项目计划', '阳绪文', '          030008-8组装工序', '2.8.8', '2026-01-14', '2026-01-14', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (328, 2, NULL, '川藏制动柜项目计划', '阳绪文', '0400评审', '3', '2026-01-14', '2026-01-15', NULL, NULL, 0.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (329, 2, NULL, '川藏制动柜项目计划', '阳绪文', '               内部评审', '3.1', '2026-01-14', '2026-01-14', NULL, NULL, 0.00, '唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (330, 2, NULL, '川藏制动柜项目计划', '阳绪文', '               客户评审', '3.2', '2026-01-15', '2026-01-15', NULL, NULL, 0.00, '唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (331, 2, NULL, '川藏制动柜项目计划', '阳绪文', '0500项目收尾', '4', '2026-01-15', '2026-01-15', NULL, NULL, 0.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (332, 2, NULL, '川藏制动柜项目计划', '阳绪文', '     0501发货', '4.1', '2026-01-15', '2026-01-15', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (333, 2, NULL, '川藏制动柜项目计划', '阳绪文', '     0501项目文件归档', '4.2', '2026-01-15', '2026-01-15', NULL, NULL, 0.00, '王志强', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (334, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '0100项目策划阶段', '1', '2025-12-25', '2025-12-25', '2025-12-25', '2025-12-25', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (335, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '     项目需求分析', '1.1', '2025-12-25', '2025-12-25', '2025-12-25', '2025-12-25', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (336, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '     召开项目启动会', '1.2', '2025-12-25', '2025-12-25', '2025-12-25', '2025-12-25', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (337, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '     组建项目团队', '1.3', '2025-12-25', '2025-12-25', '2025-12-25', '2025-12-25', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (338, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '     项目计划制定', '1.4', '2025-12-25', '2025-12-25', '2025-12-25', '2025-12-25', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (339, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '0200项目设计研发阶段', '2', '2025-12-25', '2025-12-25', '2025-12-25', '2025-12-25', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (340, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '     020001设计三维梳理及二维输出', '2.1', '2025-12-25', '2025-12-25', '2025-12-25', '2025-12-25', 100.00, '杨文博', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (341, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '0300样机试制阶段', '3', '2025-12-20', '2026-01-14', '2025-12-20', NULL, 71.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (342, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '     030001工艺BOM及流程下发', '3.1', '2025-12-25', '2025-12-27', '2025-12-25', '2025-12-27', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (343, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '     030002项目订单下达', '3.2', '2025-12-25', '2025-12-27', '2025-12-25', '2025-12-27', 100.00, '黄万庆', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (344, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '     030003 PFMEA分析', '3.3', '2025-12-27', '2025-12-30', '2025-12-27', '2025-12-30', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (345, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '     030004工艺文件编制', '3.4', '2025-12-27', '2025-12-31', '2025-12-27', '2025-12-31', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (346, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '     030005特殊工序识别确认', '3.5', '2025-12-27', '2025-12-31', '2025-12-27', '2025-12-31', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (347, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '     030006工艺验证', '3.6', '2025-12-27', '2025-12-31', '2025-12-27', '2025-12-31', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (348, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '     030007编制质量控制文件', '3.7', '2025-12-31', '2026-01-06', '2025-12-31', NULL, 0.00, '唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (349, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '     030008样机生产', '3.8', '2025-12-20', '2026-01-14', '2025-12-20', NULL, 63.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (350, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '          030008-1原材料采购', '3.8.1', '2025-12-20', '2025-12-27', '2025-12-20', '2025-12-27', 100.00, '刘年花', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (351, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '          030008-2配件采购（下料件、机加件）', '3.8.2', '2025-12-27', '2026-01-04', '2025-12-27', '2026-01-04', 100.00, '刘嘉', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (352, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '          030008-5柜体组焊', '3.8.3', '2026-01-06', '2026-01-08', '2026-01-06', NULL, 0.00, '刘嘉', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (353, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '          030008-6内部焊接评审', '3.8.4', '2026-01-09', '2026-01-09', NULL, NULL, 0.00, '唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (354, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '          030008-11油漆工序', '3.8.5', '2026-01-12', '2026-01-13', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (355, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '          030008-12组装工序', '3.8.6', '2026-01-14', '2026-01-14', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (356, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '          030008-13例行试验（流量、气密、称重）', '3.8.7', '2026-01-14', '2026-01-14', NULL, NULL, 0.00, '申外成,唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (357, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '0400评审', '4', '2026-01-14', '2026-01-15', NULL, NULL, 0.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (358, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '               内部评审', '4.1', '2026-01-14', '2026-01-14', NULL, NULL, 0.00, '唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (359, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '               客户评审', '4.2', '2026-01-15', '2026-01-15', NULL, NULL, 0.00, '唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (360, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '0500项目收尾', '5', '2026-01-15', '2026-01-15', NULL, NULL, 0.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (361, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '     0501发货', '5.1', '2026-01-15', '2026-01-15', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (362, 3, NULL, '川藏线动力电池柜项目计划', '张俊杰', '     0502项目文件归档', '5.2', '2026-01-15', '2026-01-15', NULL, NULL, 0.00, '王志强', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (363, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '0100项目策划阶段', '1', '2025-12-05', '2025-12-09', '2025-12-09', '2025-12-09', 100.00, 'nan', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (364, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '     项目需求分析', '1.1', '2025-12-09', '2025-12-09', '2025-12-09', '2025-12-09', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (365, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '     召开项目启动会', '1.2', '2025-12-09', '2025-12-09', '2025-12-09', '2025-12-09', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (366, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '     组建项目团队', '1.3', '2025-12-09', '2025-12-09', '2025-12-09', '2025-12-09', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (367, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '     项目计划制定', '1.4', '2025-12-09', '2025-12-09', '2025-12-09', '2025-12-09', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (368, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '0300样机试制阶段', '2', '2025-12-05', '2026-01-05', '2025-12-05', NULL, 99.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (369, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '     030001工艺BOM及流程下发', '2.1', '2025-12-10', '2025-12-10', '2025-12-10', '2025-12-10', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (370, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '     030002项目订单下达', '2.2', '2025-12-11', '2025-12-11', '2025-12-11', '2025-12-11', 100.00, '黄万庆', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (371, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '     030003 PFMEA分析', '2.3', '2025-12-11', '2025-12-15', '2025-12-11', '2025-12-15', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (372, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '     030004工艺文件编制', '2.4', '2025-12-11', '2025-12-15', '2025-12-11', '2025-12-15', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (373, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '     030005特殊工序识别确认', '2.5', '2025-12-11', '2025-12-15', '2025-12-11', '2025-12-15', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (374, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '     030006工艺验证', '2.6', '2025-12-15', '2025-12-20', '2025-12-15', '2025-12-20', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (375, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '     030007编制质量控制文件', '2.7', '2025-12-11', '2025-12-15', '2025-12-11', '2025-12-15', 100.00, '唐再章', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (376, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '     030008样机生产', '2.8', '2025-12-05', '2026-01-05', '2025-12-05', NULL, 99.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (377, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '          030008-1原材料采购', '2.8.1', '2025-12-05', '2025-12-09', '2025-12-05', '2025-12-09', 100.00, '刘年花', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (378, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '          030008-2配件采购（下料件、机加件）', '2.8.2', '2025-12-10', '2025-12-14', '2025-12-10', '2025-12-14', 100.00, '刘嘉', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (379, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '          030008-5柜体组焊', '2.8.3', '2025-12-14', '2025-12-29', '2025-12-14', '2025-12-29', 100.00, '刘嘉', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (380, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '          030008-6内部焊接评审', '2.8.4', '2025-12-29', '2025-12-29', '2025-12-29', '2025-12-29', 100.00, '唐再章', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (381, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '          030008-8油漆工序', '2.8.5', '2025-12-30', '2026-01-03', '2025-12-30', '2026-01-06', 100.00, '申外成', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (382, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '          030008-9组装工序', '2.8.6', '2026-01-04', '2026-01-04', '2026-01-06', '2026-01-07', 100.00, '申外成', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (383, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '          030008-10例行试验（尺寸测量、称重）', '2.8.7', '2026-01-04', '2026-01-04', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (384, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '0400评审', '3', '2026-01-05', '2026-01-05', '2026-01-13', '2026-01-14', 100.00, 'nan', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (385, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '               内部评审', '3.1', '2026-01-05', '2026-01-05', '2026-01-13', '2026-01-13', 100.00, '唐再章', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (386, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '               客户评审', '3.2', '2026-01-05', '2026-01-05', '2026-01-14', '2026-01-14', 100.00, '唐再章', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (387, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '0500项目收尾', '4', '2026-01-06', '2026-01-08', NULL, NULL, 0.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (388, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '     0501发货', '4.1', '2026-01-06', '2026-01-06', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (389, 4, NULL, '川藏线网侧柜项目计划', '张俊杰', '     0501项目文件归档', '4.2', '2026-01-06', '2026-01-08', NULL, NULL, 0.00, '王志强', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (390, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '0100项目策划阶段', '1', '2025-12-09', '2025-12-13', '2025-12-09', '2025-12-13', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (391, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '     项目需求分析', '1.1', '2025-12-09', '2025-12-09', '2025-12-09', '2025-12-09', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (392, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '     项目订单下达', '1.2', '2025-12-13', '2025-12-13', '2025-12-13', '2025-12-13', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (393, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '     召开项目启动会', '1.3', '2025-12-09', '2025-12-09', '2025-12-09', '2025-12-09', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (394, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '     组建项目团队', '1.4', '2025-12-09', '2025-12-09', '2025-12-09', '2025-12-09', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (395, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '     项目计划制定', '1.5', '2025-12-09', '2025-12-09', '2025-12-09', '2025-12-09', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (396, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '0300样机试制阶段', '2', '2025-12-13', '2026-01-15', '2025-12-13', NULL, 59.00, '王志强', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (397, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '     030001工艺BOM及流程下发', '2.1', '2025-12-13', '2025-12-13', '2025-12-13', '2025-12-13', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (398, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '     030003 PFMEA分析', '2.2', '2025-12-13', '2025-12-13', '2025-12-13', '2025-12-13', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (399, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '     030004工艺文件编制', '2.3', '2025-12-13', '2025-12-18', '2025-12-13', '2025-12-18', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (400, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '     030005特殊工序识别确认', '2.4', '2025-12-13', '2025-12-13', '2025-12-13', '2025-12-13', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (401, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '     030006工艺验证', '2.5', '2025-12-13', '2025-12-13', '2025-12-13', '2025-12-13', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (402, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '     030007编制质量控制文件', '2.6', '2025-12-13', '2025-12-13', '2025-12-13', '2025-12-13', 100.00, '唐再章', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (403, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '     030008样机生产', '2.7', '2025-12-13', '2026-01-15', '2025-12-13', NULL, 48.00, '王志强', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (404, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '          030008-1原材料采购', '2.7.1', '2025-12-13', '2025-12-14', '2025-12-13', '2025-12-14', 100.00, '刘年花', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (405, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '          030008-2配件采购（下料件、机加件）', '2.7.2', '2025-12-13', '2025-12-15', '2025-12-13', '2025-12-15', 100.00, '刘嘉', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (406, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '          030008-3柜体组焊', '2.7.3', '2025-12-16', '2025-12-31', '2025-12-16', NULL, 0.00, '刘嘉', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (407, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '          030008-4铝门组焊', '2.7.4', '2025-12-13', '2025-12-30', '2025-12-13', '2025-12-30', 100.00, '刘嘉', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (408, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '          030008-7内部焊接评审', '2.7.5', '2026-01-02', '2026-01-02', '2025-12-31', '2026-01-10', 100.00, '唐再章', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (409, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '          030008-11油漆工序', '2.7.6', '2026-01-03', '2026-01-07', '2026-01-11', NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (410, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '          030008-12组装工序', '2.7.7', '2026-01-08', '2026-01-08', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (411, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '          030008-13例行试验（称重）', '2.7.8', '2026-01-08', '2026-01-08', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (412, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '0400评审', '3', '2026-01-09', '2026-01-09', NULL, NULL, 0.00, '唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (413, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '               内部评审', '3.1', '2026-01-09', '2026-01-09', NULL, NULL, 0.00, '唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (414, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '               客户评审', '3.2', '2026-01-09', '2026-01-09', NULL, NULL, 0.00, '唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (415, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '0500项目收尾', '4', '2026-01-10', '2026-01-15', NULL, NULL, 0.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (416, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '     0501发货', '4.1', '2026-01-10', '2026-01-10', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (417, 5, NULL, '川藏线蓄电池柜项目计划', '阳绪文', '     0501项目文件归档', '4.2', '2026-01-10', '2026-01-15', NULL, NULL, 0.00, '王志强', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (418, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '0100项目策划阶段', '1', '2025-12-26', '2026-01-06', '2025-12-26', '2026-01-06', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (419, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '     项目需求分析', '1.1', '2025-12-26', '2026-01-06', '2025-12-26', '2026-01-04', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (420, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '     召开项目启动会', '1.2', '2026-01-06', '2026-01-06', '2026-01-06', '2026-01-06', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (421, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '     组建项目团队', '1.3', '2026-01-05', '2026-01-05', '2026-01-06', '2026-01-06', 100.00, '王志强', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (422, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '     项目计划制定', '1.4', '2026-01-05', '2026-01-05', '2026-01-06', '2026-01-06', 100.00, '王志强', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (423, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '0300样机试制阶段', '2', '2026-01-06', '2026-01-19', '2026-01-06', NULL, 53.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (424, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '     030001工艺BOM及流程下发', '2.1', '2026-01-06', '2026-01-06', '2026-01-06', '2026-01-06', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (425, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '     030002项目订单下达', '2.2', '2026-01-06', '2026-01-06', '2026-01-06', '2026-01-06', 100.00, '黄万庆', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (426, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '     030004工艺文件编制', '2.3', '2026-01-06', '2026-01-10', NULL, NULL, 0.00, '王志强', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (427, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '     030006工艺验证', '2.4', '2026-01-06', '2026-01-10', '2026-01-06', '2026-01-06', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (428, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '     030007编制质量控制文件', '2.5', '2026-01-06', '2026-01-10', '2026-01-06', '2026-01-06', 100.00, '唐再章', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (429, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '     030008样机生产', '2.6', '2026-01-06', '2026-01-19', '2026-01-06', NULL, 33.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (430, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '          030008-1原材料采购', '2.6.1', '2026-01-06', '2026-01-06', '2026-01-06', '2026-01-06', 100.00, '刘年花', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (431, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '          030008-2配件采购（下料件、机加件）', '2.6.2', '2026-01-06', '2026-01-09', '2026-01-06', '2026-01-14', 100.00, '刘嘉', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (432, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '          030008-3片装组焊', '2.6.3', '2026-01-09', '2026-01-11', NULL, NULL, 0.00, '刘嘉', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (433, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '          030008-4柜体组焊', '2.6.4', '2026-01-12', '2026-01-15', NULL, NULL, 0.00, '刘嘉', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (434, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '          030008-5内部焊接评审', '2.6.5', '2026-01-16', '2026-01-16', NULL, NULL, 0.00, '唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (435, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '          030008-6喷砂及底漆工序', '2.6.6', '2026-01-16', '2026-01-17', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (436, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '          030008-7油漆工序', '2.6.7', '2026-01-18', '2026-01-18', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (437, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '          030008-8组装工序', '2.6.8', '2026-01-19', '2026-01-19', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (438, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '0400评审', '3', '2026-01-19', '2026-01-20', NULL, NULL, 0.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (439, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '               内部评审', '3.1', '2026-01-19', '2026-01-19', NULL, NULL, 0.00, '唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (440, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '               客户评审', '3.2', '2026-01-20', '2026-01-20', NULL, NULL, 0.00, '唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (441, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '0500项目收尾', '4', '2026-01-20', '2026-01-20', NULL, NULL, 0.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (442, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '     0501发货', '4.1', '2026-01-20', '2026-01-20', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (443, 6, NULL, '川藏线风源柜项目计划', '张俊杰', '     0501项目文件归档', '4.2', '2026-01-20', '2026-01-20', NULL, NULL, 0.00, '王志强', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (444, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '0100项目策划阶段', '1', '2025-12-29', '2026-01-20', '2025-12-29', '2025-12-31', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (445, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '     项目需求分析', '1.1', '2025-12-29', '2025-12-31', '2025-12-29', '2025-12-31', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (446, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '     召开项目启动会', '1.2', '2025-12-30', '2025-12-30', '2025-12-30', '2025-12-30', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (447, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '     组建项目团队', '1.3', '2025-12-30', '2025-12-30', '2025-12-30', '2025-12-30', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (448, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '     项目计划制定', '1.4', '2025-12-30', '2025-12-30', '2025-12-30', '2025-12-30', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (449, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '0300样机试制阶段', '2', '2025-12-29', '2026-01-19', '2025-12-29', NULL, 76.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (450, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '     030001工艺BOM及流程下发', '2.1', '2025-12-29', '2025-12-31', '2025-12-29', '2025-12-31', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (451, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '     030002项目订单下达', '2.2', '2025-12-31', '2025-12-31', '2025-12-31', '2025-12-31', 100.00, '黄万庆', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (452, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '     030004工艺文件编制', '2.3', '2025-12-31', '2026-01-06', '2025-12-31', '2025-12-31', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (453, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '     030005特殊工序识别确认', '2.4', '2025-12-31', '2026-01-06', '2025-12-31', '2026-01-04', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (454, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '     030006工艺验证', '2.5', '2025-12-31', '2026-01-06', '2025-12-31', '2026-01-04', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (455, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '     030007编制质量控制文件', '2.6', '2025-12-31', '2026-01-06', '2025-12-31', '2026-01-04', 100.00, '唐再章', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (456, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '     030008样机生产', '2.7', '2025-12-31', '2026-01-19', '2025-12-31', NULL, 50.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (457, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '          030008-1原材料采购', '2.7.1', '2025-12-31', '2026-01-06', '2025-12-31', '2026-01-04', 100.00, '刘年花', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (458, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '          030008-2配件采购（下料件、机加件）', '2.7.2', '2025-12-31', '2026-01-06', '2025-12-31', '2026-01-06', 100.00, '刘嘉', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (459, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '          030008-4柜体组焊', '2.7.3', '2026-01-06', '2026-01-13', '2026-01-06', NULL, 0.00, '刘嘉', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (460, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '          030008-5内部焊接评审', '2.7.4', '2026-01-14', '2026-01-14', NULL, NULL, 0.00, '唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (461, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '          030008-6喷砂及底漆工序', '2.7.5', '2026-01-15', '2026-01-17', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (462, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '          030008-7油漆工序', '2.7.6', '2026-01-18', '2026-01-18', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (463, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '          030008-8组装工序', '2.7.7', '2026-01-19', '2026-01-19', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (464, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '0400评审', '3', '2026-01-19', '2026-01-20', NULL, NULL, 0.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (465, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '               内部评审', '3.1', '2026-01-19', '2026-01-19', NULL, NULL, 0.00, '唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (466, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '               客户评审', '3.2', '2026-01-20', '2026-01-20', NULL, NULL, 0.00, '唐再章', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (467, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '0500项目收尾', '4', '2026-01-20', '2026-01-20', NULL, NULL, 0.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (468, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '     0501发货', '4.1', '2026-01-20', '2026-01-20', NULL, NULL, 0.00, '申外成', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (469, 7, NULL, '朔黄制动柜项目计划', '阳绪文', '     0501项目文件归档', '4.2', '2026-01-20', '2026-01-20', NULL, NULL, 0.00, '王志强', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (470, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '0100项目策划阶段', '1', '2025-12-10', '2025-12-10', '2025-12-10', '2025-12-10', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (471, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '     项目需求分析', '1.1', '2025-12-10', '2025-12-10', '2025-12-10', '2025-12-10', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (472, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '     召开项目启动会', '1.2', '2025-12-10', '2025-12-10', '2025-12-10', '2025-12-10', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (473, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '     组建项目团队', '1.3', '2025-12-10', '2025-12-10', '2025-12-10', '2025-12-10', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (474, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '     项目计划制定', '1.4', '2025-12-10', '2025-12-10', '2025-12-10', '2025-12-10', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (475, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '0200项目设计研发阶段', '2', '2025-12-01', '2025-12-10', '2025-12-01', '2025-12-10', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (476, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '     020001设计三维梳理及二维输出', '2.1', '2025-12-01', '2025-12-10', '2025-12-01', '2025-12-10', 100.00, '杨文博', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (477, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '0300样机试制阶段', '3', '2025-12-12', '2025-12-30', '2025-12-12', '2026-01-07', 100.00, 'nan', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (478, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '     030001工艺BOM及流程下发', '3.1', '2025-12-12', '2025-12-12', '2025-12-12', '2025-12-12', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (479, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '     030002项目订单下达', '3.2', '2025-12-12', '2025-12-13', '2025-12-12', '2025-12-13', 100.00, '向浩', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (480, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '     030003 PFMEA分析', '3.3', '2025-12-13', '2025-12-16', '2025-12-13', '2025-12-16', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (481, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '     030004工艺文件编制', '3.4', '2025-12-12', '2025-12-16', '2025-12-12', '2025-12-16', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (482, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '     030005特殊工序识别确认', '3.5', '2025-12-12', '2025-12-16', '2025-12-12', '2025-12-16', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (483, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '     030006工艺验证', '3.6', '2025-12-12', '2025-12-16', '2025-12-12', '2025-12-16', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (484, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '     030007编制质量控制文件', '3.7', '2025-12-12', '2025-12-16', '2025-12-12', '2025-12-16', 100.00, '唐再章', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (485, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '     030008样机生产', '3.8', '2025-12-12', '2025-12-30', '2025-12-12', '2026-01-07', 100.00, 'nan', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (486, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '          030008-1原材料采购', '3.8.1', '2025-12-12', '2025-12-22', '2025-12-12', '2025-12-22', 100.00, '刘年花', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (487, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '          030008-2配件采购（下料件、机加件）', '3.8.2', '2025-12-14', '2025-12-17', '2025-12-14', '2025-12-21', 100.00, '刘嘉', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (488, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '          030008-4片装组焊', '3.8.3', '2025-12-18', '2025-12-19', '2025-12-21', '2025-12-21', 100.00, '申外成', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (489, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '          030008-5柜体组焊', '3.8.4', '2025-12-20', '2025-12-21', '2025-12-22', '2025-12-22', 100.00, '申外成', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (490, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '          030008-6吊耳机加', '3.8.5', '2025-12-22', '2025-12-22', '2025-12-23', '2025-12-24', 100.00, '申外成', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (491, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '          030008-7内部焊接评审', '3.8.6', '2025-12-23', '2025-12-23', '2025-12-24', '2025-12-24', 100.00, '唐再章', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (492, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '          030008-8客户焊接评审', '3.8.7', '2025-12-24', '2025-12-24', '2025-12-25', '2025-12-25', 100.00, '唐再章', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (493, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '          030008-9喷砂及底漆工序', '3.8.8', '2025-12-25', '2025-12-26', '2025-12-27', '2025-12-28', 100.00, '申外成', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (494, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '          030008-10顶板铆接工序', '3.8.9', '2025-12-27', '2025-12-27', '2025-12-29', '2025-12-30', 100.00, '申外成', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (495, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '          030008-11油漆工序', '3.8.10', '2025-12-28', '2025-12-29', '2025-12-31', '2026-01-07', 100.00, '申外成', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (496, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '          030008-12组装工序', '3.8.11', '2025-12-30', '2025-12-30', '2026-01-07', '2026-01-07', 100.00, '申外成', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (497, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '          030008-13例行试验（流量、气密、称重）', '3.8.12', '2025-12-30', '2025-12-30', '2026-01-07', '2026-01-07', 100.00, '申外成,唐再章', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (498, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '0400评审', '4', '2025-12-31', '2025-12-31', '2026-01-08', NULL, 50.00, 'nan', '异常', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (499, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '               内部评审', '4.1', '2025-12-31', '2025-12-31', '2026-01-08', '2026-01-08', 100.00, '唐再章', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (500, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '               客户评审', '4.2', '2025-12-31', '2025-12-31', '2026-01-09', '2026-01-09', 0.00, '唐再章', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (501, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '0500项目收尾', '5', '2025-12-31', '2025-12-31', '2026-01-09', '2026-01-09', 0.00, 'nan', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (502, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '     0501发货', '5.1', '2025-12-31', '2025-12-31', '2026-01-09', '2026-01-09', 0.00, '申外成', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (503, 8, NULL, '马来西亚3CS蓄电池箱项目计划', '阳绪文', '     0501项目文件归档', '5.2', '2025-12-31', '2025-12-31', '2026-01-09', '2026-01-09', 0.00, '王志强', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (504, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '0100项目策划阶段', '1', '2025-12-12', '2025-12-12', '2025-12-12', '2025-12-12', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (505, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     项目需求分析', '1.1', '2025-12-12', '2025-12-12', '2025-12-12', '2025-12-12', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (506, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     项目订单下达', '1.2', '2025-12-12', '2025-12-12', '2025-12-12', '2025-12-12', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (507, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     召开项目启动会', '1.3', '2025-12-12', '2025-12-12', '2025-12-12', '2025-12-12', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (508, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     组建项目团队', '1.4', '2025-12-12', '2025-12-12', '2025-12-12', '2025-12-12', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (509, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     项目计划制定', '1.5', '2025-12-12', '2025-12-12', '2025-12-12', '2025-12-12', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (510, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '0200项目设计研发阶段', '2', '2025-12-13', '2025-12-13', '2025-12-13', '2025-12-13', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (511, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     020001设计策划', '2.1', '2025-12-13', '2025-12-13', '2025-12-13', '2025-12-13', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (512, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     020002设计输入响应', '2.2', '2025-12-13', '2025-12-13', '2025-12-13', '2025-12-13', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (513, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     020003方案设计', '2.3', '2025-12-13', '2025-12-13', '2025-12-13', '2025-12-13', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (514, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     020004输出初始材料采购清单', '2.4', '2025-12-13', '2025-12-13', '2025-12-13', '2025-12-13', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (515, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     020005设计输出', '2.5', '2025-12-13', '2025-12-13', '2025-12-13', '2025-12-13', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (516, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     020006设计输出评审', '2.6', '2025-12-13', '2025-12-13', '2025-12-13', '2025-12-13', 100.00, 'nan', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (517, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '0300样机试制阶段', '3', '2025-12-12', '2025-12-28', '2025-12-12', '2026-01-14', 100.00, 'nan', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (518, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     030001工艺BOM及流程下发', '3.1', '2025-12-12', '2025-12-12', '2025-12-12', '2025-12-12', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (519, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     030002项目订单下达', '3.2', '2025-12-12', '2025-12-12', '2025-12-12', '2025-12-12', 100.00, '黄万庆', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (520, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     030003 PFMEA分析', '3.3', '2025-12-12', '2025-12-12', '2025-12-12', '2025-12-12', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (521, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     030004工艺文件编制', '3.4', '2025-12-12', '2025-12-12', '2025-12-12', '2025-12-12', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (522, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     030005特殊工序识别确认', '3.5', '2025-12-12', '2025-12-12', '2025-12-12', '2025-12-12', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (523, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     030006工艺验证', '3.6', '2025-12-12', '2025-12-12', '2025-12-12', '2025-12-12', 100.00, '王志强', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (524, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     030007编制质量控制文件', '3.7', '2025-12-12', '2025-12-12', '2025-12-12', '2025-12-12', 100.00, '唐再章', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (525, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     030008样机生产', '3.8', '2025-12-12', '2025-12-28', '2025-12-12', '2026-01-14', 100.00, 'nan', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (526, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '          030008-1原材料采购', '3.8.1', '2025-12-12', '2025-12-12', '2025-12-12', '2025-12-12', 100.00, '刘年花', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (527, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '          030008-2配件采购（下料件、机加件）', '3.8.2', '2025-12-12', '2025-12-14', '2025-12-12', '2025-12-14', 100.00, '刘嘉', '完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (528, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '          030008-3柜体组焊', '3.8.3', '2025-12-15', '2025-12-22', '2025-12-15', '2025-12-30', 100.00, '申外成', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (529, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '          柜体组焊评审', '3.8.4', '2025-12-22', '2025-12-22', '2025-12-30', '2025-12-30', 100.00, '唐再章', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (530, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '          030008-4柜体打砂+底漆', '3.8.5', '2025-12-23', '2025-12-24', '2025-12-30', '2025-12-31', 100.00, '申外成', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (531, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '          030008-5柜体铆接', '3.8.6', '2025-12-25', '2025-12-25', '2025-12-31', '2026-01-03', 100.00, '申外成', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (532, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '          030008-5油漆工序', '3.8.7', '2025-12-26', '2025-12-27', '2026-01-03', '2026-01-13', 100.00, '申外成', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (533, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '          030008-6组装工序', '3.8.8', '2025-12-27', '2025-12-28', '2026-01-14', '2026-01-14', 100.00, '申外成', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (534, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '0400评审', '4', '2025-12-28', '2025-12-29', '2026-01-14', '2026-01-16', 100.00, 'nan', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (535, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '               内部评审', '4.1', '2025-12-28', '2025-12-29', '2026-01-14', '2026-01-14', 100.00, '唐再章', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (536, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '               客户评审', '4.2', '2025-12-29', '2025-12-29', '2026-01-16', '2026-01-16', 100.00, '唐再章', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (537, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     整改及交付', '4.3', '2025-12-29', '2025-12-29', '2026-01-16', '2026-01-16', 100.00, 'nan', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (538, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '0500项目收尾', '5', '2025-12-30', '2025-12-31', '2026-01-17', '2026-01-17', 100.00, 'nan', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (539, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     0501项目文件归档', '5.1', '2025-12-30', '2025-12-30', '2026-01-18', '2026-01-19', 100.00, '王志强', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');
INSERT INTO `project_tasks` VALUES (540, 9, NULL, '马来西亚3CS锂电池柜项目计划', '阳绪文', '     0502项目总结会', '5.2', '2025-12-30', '2025-12-31', '2026-01-19', '2026-01-19', 100.00, '王志强', '延期完成', '2026-01-21 18:25:40', '2026-01-21 18:25:40');

SET FOREIGN_KEY_CHECKS = 1;
